src/Catalogs/МенюЛояльности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>МенюЛояльности</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Регионы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоРеализации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаРеализации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Станция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Станции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТТ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыТТ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЭлементыМеню</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГруппыМенюЛояльности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Действие</Name>
							<Comment>Товар/Очистить купоны/Очистить карту лояльности</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ДействияЭлементовМеню</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСУПтовара</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>8</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстКнопки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/ДополнительныеСвойства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ДополнительныеСвойства</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИнформационнаяБаза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеБазы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/МенюЛояльности/Forms/ФормаСписка/module.bsl
Перем ФормаМеню;
Перем фТолькоАктуальные;
Процедура ЭлементыМенюТекстКнопкиОткрытие(Элемент, СтандартнаяОбработка)
	ирОбщий.ОткрытьФормуПроизвольногоЗначенияЛкс(ЭлементыФормы.ЭлементыМеню.ТекущиеДанные.ТекстКнопки);	
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

Процедура КнопкаЗапуститьНажатие(Элемент)
	Если ФормаМеню = Неопределено Тогда
		ФормаМеню = ТекущийОбъект.ПолучитьФорму(,ЭтаФорма, 1);
		ФормаМеню.ПоложениеОкна = ВариантПоложенияОкна.НеПерекрыватьВладельца;
		ФормаМеню.ИзменятьСпособОтображенияОкна = ИзменениеСпособаОтображенияОкна.Разрешить;
		ФормаМеню.РазрешитьСоединятьОкно = Истина;
		ФормаМеню.Открыть();
		
	ИначеЕсли ФормаМеню.Открыта() Тогда
		ФормаМеню.Активизировать();      		
	Иначе
		ФормаМеню.Открыть();
	КонецЕсли;
	ФормаМеню.СправочникОбъект = ТекущийОбъект;
	ФормаМеню.СоздатьЭлементыФормы();
КонецПроцедуры

Процедура ЭлементыМенюПриАктивизацииСтроки(Элемент)
	ТД = ЭлементыФормы.ЭлементыМеню.ТекущиеДанные;
	Если ТД = Неопределено Тогда
		ЭлементыФормы.ЭлементыМеню.Колонки.КодСУПтовара.Видимость = Истина;
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ТД.Действие) Тогда
		ТД.Действие = Справочники.ДействияЭлементовМеню.ДобавитьТовар;
	КонецЕсли;
	
	//ЭлементыФормы.ЭлементыМеню.Колонки.КодСУПтовара.Видимость = ТД.Действие = Справочники.ДействияЭлементовМеню.ДобавитьТовар;
	ОбновитьФормуМеню();
КонецПроцедуры

Процедура СправочникСписокПриАктивизацииСтроки(Элемент)
	ТекущаяНастройка = Элемент.ТекущаяСтрока;
	Если ТекущаяНастройка = ТекущийОбъект.Ссылка Тогда
		Возврат;
	КонецЕсли; 
	
	Если Модифицированность Тогда
		Ответ = Вопрос("Сохранить изменения в """+ТекущийОбъект.Ссылка.Наименование+"""?", РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Да И НЕ ЗаписатьВФорме() ИЛИ Ответ = КодВозвратаДиалога.Отмена Тогда
			// возвращаемся на строку в которой были изменения
			Элемент.ТекущаяСтрока = ТекущийОбъект.Ссылка;
			Возврат;
		КонецЕсли;
	КонецЕсли; 
	
	Если ТекущаяНастройка = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	Попытка
		ТекущийОбъект = ТекущаяНастройка.ПолучитьОбъект();	
		Модифицированность = Ложь;
	Исключение
	КонецПопытки;
	
	ДобавитьСвойства();
	ДополнительныеСвойства.Отбор.Объект.Установить(ТекущийОбъект.Ссылка);
		
	
	
КонецПроцедуры


Процедура ДобавитьСвойства() Экспорт
	Если ТекущийОбъект.ЭтоНовый() Тогда
		Возврат;
	КонецЕсли;
	ОбязательныеСвойства = Массив("Количество кнопок по горизонтали", "Количество кнопок по вертикали", "Размер шрифта");
	СвойстваОтдохни = Массив("Excise_Server", "Excise_User", "Excise_Pwd", "УТМ");
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ДополнительныеСвойства.Свойство,
	|	ДополнительныеСвойства.Значение
	|ИЗ
	|	РегистрСведений.ДополнительныеСвойства КАК ДополнительныеСвойства
	|ГДЕ
	|	Объект = &Объект");
	Запрос.УстановитьПараметр("Объект", ТекущийОбъект.Ссылка);
	
	тзСвойства = Запрос.Выполнить().Выгрузить();
	Для Каждого Свойство Из ОбязательныеСвойства Цикл
		
		ст = тзСвойства.Найти(Свойство ,"Свойство");
		Если ст <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Нов = РегистрыСведений.ДополнительныеСвойства.СоздатьМенеджерЗаписи();
		
		Нов.Объект = ТекущийОбъект.Ссылка;
	
		Нов.Свойство = Свойство;
		
		Если Не ЗначениеЗаполнено(Нов.Значение) Тогда
			Нов.Значение = ЗначениеСвойстваПоУмолчанию(Свойство);
			Нов.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ЗначениеСвойстваПоУмолчанию(Свойство)
	Если СтрНайти(Свойство, "Количество кнопок") Тогда
		Возврат 4;
	ИначеЕсли СтрНайти(Свойство, "Размер шрифта") Тогда
		Возврат 14;
	КонецЕсли;
КонецФункции

Функция ЗаписатьВФорме()
	Попытка
		ТекущийОбъект.Записать();
		Модифицированность = Ложь;
		Возврат Истина;
		
	Исключение
		Возврат Ложь;
	КонецПопытки;
КонецФункции

Процедура СправочникСписокПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Попытка
		ТекущийОбъект = Элемент.ТекущаяСтрока.ПолучитьОбъект();	
	Исключение
	КонецПопытки;
КонецПроцедуры

Процедура ЭлементыМенюПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ОбновитьФормуМеню();
	
КонецПроцедуры

Процедура ОбновитьФормуМеню()
	
	Если ФормаМеню <> Неопределено Тогда
		Если ФормаМеню.Открыта() Тогда
			ФормаМеню.СправочникОбъект = ТекущийОбъект;
			ФормаМеню.СоздатьЭлементыФормы();
			ФормаМеню.Модифицированность = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура КоманднаяПанель2кнТолькоДействующие(Кнопка)
	ЭлементыФормы.КПверх.Кнопки.кнТолькоДействующие.Пометка = Не ЭлементыФормы.КПверх.Кнопки.кнТолькоДействующие.Пометка;
	фТолькоАктуальные = ЭлементыФормы.КПверх.Кнопки.кнТолькоДействующие.Пометка;
	УстановитьОтбор();
КонецПроцедуры

Процедура УстановитьОтбор() 
	Если фТолькоАктуальные Тогда
		
		
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	МенюЛояльности.Ссылка КАК Ссылка,
		|	ВЫБОР МенюЛояльности.Станция
		|		КОГДА ЗНАЧЕНИЕ(Справочник.МенюЛояльности.ПустаяСсылка)
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ДляВсехСтанций
		|ИЗ
		|	Справочник.МенюЛояльности КАК МенюЛояльности
		|ГДЕ
		|	(МенюЛояльности.ДатаНачалаДействия <= &ТекДата
		|			ИЛИ МенюЛояльности.ДатаНачалаДействия = ДАТАВРЕМЯ(1, 1, 1))
		|	И (МенюЛояльности.ДатаОкончанияДействия >= &ТекДата
		|			ИЛИ МенюЛояльности.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1))
		|	И НЕ МенюЛояльности.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДляВсехСтанций,
		|	МенюЛояльности.ДатаНачалаДействия УБЫВ");
		Запрос.УстановитьПараметр("ТекДата", НаДату);
		Рез =  Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
		
		СправочникСписок.Отбор.Ссылка.ВидСравнения = ВидСравнения.ВСписке;
		СправочникСписок.Отбор.Ссылка.Значение.ЗагрузитьЗначения(Рез);	
		СправочникСписок.Отбор.Ссылка.Использование = Истина;
		
		ЭлементыФормы.КПверх.Кнопки.кнТолькоДействующие.Текст = "Показывать только актуальные на";
		ЭлементыФормы.НаДату.Видимость = Истина;
	Иначе
		СправочникСписок.Отбор.Ссылка.Использование = Ложь;
		ЭлементыФормы.КПверх.Кнопки.кнТолькоДействующие.Текст = "Показывать только актуальные";
		ЭлементыФормы.НаДату.Видимость = Ложь;
	КонецЕсли;
	СправочникСписок.Обновить();
КонецПроцедуры

Процедура НаДатуПриИзменении(Элемент)
	УстановитьОтбор();
КонецПроцедуры

Процедура КнопкаВыгрузитьНажатие(Элемент)
	УправлениеРИБ.ОткрытьФормуОчередиВыгрузкиПоОбъекту(ТекущийОбъект.Ссылка);
КонецПроцедуры






НаДату = ТекущаяДата();

ЭлементыФормы.СправочникСписок.СпособРедактирования = СпособРедактированияСписка.ВСписке;
ОтборПУ = СправочникСписок.Отбор.ПометкаУдаления;
ОтборПУ.Установить(Ложь);
